import re
import requests
import json
from bs4 import BeautifulSoup


def GetHtml(urlin):
	res = requests.get(urlin)
	Html = res.text
	return Html

def ParseWiki(Html):
	soup = BeautifulSoup(Html, 'html.parser')
	mydivs = soup.findAll("div", {"class": "mw-content-ltr"}) 
	verbstring = mydivs[2].get_text()
	verbs = [verb for verb in verbstring.split('\n') if len(verb) > 1]
	return verbs

def main():
	Letters = ['а', 'абу', 'ада', 'акт', 'алт', 'анд', 'апп', 'арх', 'бар', 'без', 'бер', 'бит', 'бол', 'боя', 'бул', 'ван', 'вве', 'вес', 'вин', 'вла', 'вок', 'вос', 'гам', 'гек', 'геф', 'гно', 'гон', 'гра', 'гру', 'дар', 'дел', 'дец', 'дин', 'дов', 'дор', 'дув', 'евл', 'его', 'ежо', 'ели', 'епи', 'еро', 'ест', 'жан', 'жев', 'жен', 'жиг', 'жир', 'жуа', 'жуп', 'зай', 'зан', 'зах', 'зее', 'зен', 'зин', 'зом', 'иве', 'идо', 'ико', 'имп', 'инт', 'иос', 'исм', 'кан', 'кас', 'ким', 'кож', 'кон', 'кра', 'кря', 'лал', 'лас', 'лег', 'леп', 'лин', 'лов', 'лук', 'мак', 'мар', 'мау', 'мер', 'мим', 'мож', 'мот', 'най', 'нат', 'ней', 'нет', 'нил', 'нов', 'ном', 'обу', 'ожи', 'оку', 'опо', 'орн', 'осл', 'отк', 'пас', 'пер', 'пис', 'плу', 'пор', 'пре', 'пуг', 'рай', 'рац', 'рел', 'рич', 'рой', 'рот', 'рут', 'сан', 'сев', 'сет', 'ско', 'сод', 'спе', 'стр', 'так', 'тва', 'тер', 'тих', 'топ', 'три', 'тум', 'уде', 'уим', 'улм', 'уни', 'урб', 'урю', 'утр', 'фак', 'фед', 'фид', 'фин', 'фок', 'фоф', 'фро', 'хак', 'хар', 'хат', 'хим', 'хок', 'хоп', 'хре', 'цар', 'цви', 'цен', 'цер', 'циг', 'цин', 'цна', 'чар', 'чел', 'чер', 'чес', 'чиж', 'чка', 'чум', 'шап', 'шва', 'шен', 'шин', 'шма', 'шта', 'шув', 'щед', 'щеп', 'щер', 'щит', 'щук', 'щуч', 'щёг', 'эвр', 'эйф', 'экт', 'эли', 'энг', 'эпо', 'эсс', 'юди', 'юли', 'юнг', 'юри', 'юрк', 'юрь', 'юсу', 'ягу', 'яко', 'яку', 'ямб', 'яно', 'яро', 'яст']
	verbs_list = []
	i = 0
	for letter in Letters:
		i += 1
		print(letter,str(i)+'/'+str(len(Letters)))
		new_verbs = ParseWiki(GetHtml('https://ru.wiktionary.org/w/index.php?title=Категория:Русские_глаголы&from='+letter))
		verbs_list += new_verbs
	verbs_set = set(verbs_list)
	with open('Russian_Verbs2.txt', 'w', encoding='utf-8') as outfile:
		verbs_out = sorted(verbs_set)
		for verb in verbs_out:
			outfile.write(verb+'\n')
	return True

main()